<?php
// Заголовок
$_['heading_title']										= 'Обмен данными с 1C v8.x (Tesla-Chita)';

// Общие текстовые надписи
$_['text_access_denied']								= 'Доступ запрещен';
$_['text_action']										= 'Действие';
$_['text_add']											= 'Добавлять';
$_['text_all']											= 'Все';
$_['text_always']										= 'Всегда';
$_['text_break']										= 'Прервать';
$_['text_browse']										= 'Обзор';
$_['text_check']										= 'Проверка';
$_['text_clear']										= 'Очистить';
$_['text_code']											= 'Код';
$_['text_confirm']										= 'Вы уверены?';
$_['text_currency']										= 'Валюта';
$_['text_deleting']										= 'Удалить';
$_['text_desc']											= 'Описание';
$_['text_disable']										= 'Отключено';
$_['text_disabling']									= 'Отключить';
$_['text_do_not_use']									= 'Не использовать';
$_['text_ean']          		        			    = 'Штрихкод';
$_['text_edit']											= 'Редактирование';
$_['text_empty']										= 'Настроек пока нет';
$_['text_enable']          		        			    = 'Включен';
$_['text_for_customer_group']							= 'Для группы покупателей';
$_['text_from_name']									= 'Из наименования';
$_['text_full']											= 'Полный';
$_['text_guid']											= 'Ид (GUID)';
$_['text_hide']											= '<Не отображается>';
$_['text_homepage']										= 'Домашняя страничка модуля';
$_['text_html_select']									= 'Список';
$_['text_html_radio']									= 'Переключатель';
$_['text_html_checkbox']								= 'Флажок';
$_['text_html_image']									= 'Изображение';
$_['text_if_empty']										= 'Если пустое';
$_['text_image_manager']								= 'Менеджер изображений';
$_['text_import']										= 'Загрузить';
$_['text_import_data']									= 'Загрузка данных';
$_['text_index']										= 'Индекс';
$_['text_manual']										= 'Вручную';
$_['text_max_filesize']									= 'Загружаемый файл не должен превышать %s Мб';
$_['text_model']										= 'Модель';
$_['text_module']										= 'Модули';
$_['text_module_name']									= 'Модуль Exchange1C v%s для 1С:Предприятие v8.3';
$_['text_module_not_install']							= '<strong>МОДУЛЬ НЕ УСТАНОВЛЕН!</strong>';
$_['text_name']											= 'Наименование';
$_['text_no']											= 'Нет';
$_['text_no_create']									= 'Не создавать';
$_['text_no_update']									= 'Не обновлять';
$_['text_not_change']									= 'Не изменять';
$_['text_off']											= 'Откл.';
$_['text_on']											= 'Вкл.';
$_['text_only_new']										= 'Только новые';
$_['text_overwrite']									= 'Перезаписать';
$_['text_preset']										= 'Предустановленное';
$_['text_price_base']									= 'Цена базовая';
$_['text_price_discount']								= 'Скидка';
$_['text_price_special']								= 'Акция';
$_['text_priority']										= 'Приоритет';
$_['text_purpose']										= 'Назначение';
$_['text_quantity']										= 'Количество';
$_['text_skip']											= 'Пропустить';
$_['text_sku']											= 'Артикул';
$_['text_sort_order']									= 'Порядок сортировки';
$_['text_status']										= 'Статус';
$_['text_success']										= 'Настройки модуля обновлены!';
$_['text_support']										= 'Поддержка только по запросу на Viber/Whatsapp +7(914)430-6000';
$_['text_template']										= 'Шаблон';
$_['text_template']										= 'Из шаблона';
$_['text_text_in_brackets']								= 'Текст в скобках';
$_['text_update']										= 'Обновлять';
$_['text_upload_error']									= 'Что-то пошло не так. Загляните в log file /system/storage/logs/';
$_['text_upload_success']								= 'Импорт завершен';
$_['text_yes']											= 'Да';

// Кнопки
$_['button_upload']										= 'Загрузить';
$_['button_add']										= 'Добавить';
$_['button_download']									= 'Скачать';

// Таблица свойств с предопределенными значениями
$_['text_database_field']								= 'Поле в базе данных';
$_['text_database_table']								= 'Таблица в базе данных';


//////////////////////////////// ВКЛАДКИ ////////////////////////////////

// Названия вкладок
$_['text_tab_store']									= 'Магазин';
$_['text_tab_general']									= 'Основные';
$_['text_tab_classifier']								= 'Классификаторы';
$_['text_tab_product']									= 'Товары';
$_['text_tab_offers']									= 'Предложения';
$_['text_tab_seo']										= 'SEO';
$_['text_tab_order']									= 'Заказы';
$_['text_tab_manual']									= 'Ручная обработка';
$_['text_tab_info']										= 'Информация';
$_['text_tab_service']									= 'Сервисные функции';
$_['text_tab_errors']									= 'Коды ошибок';
$_['text_tab_description']								= 'Описание модуля';

//////////////////////////////// ПРОЧЕЕ ////////////////////////////////

$_['label_available_patterns']							= 'Доступные паттерны: ';
$_['text_under_development']							= 'В стадии разработки';
$_['source_code']       								= 'Исходный код на GitHub';
$_['error_permission']									= 'У Вас нет прав для управления этим модулем!';

//////////////////////////// ОСНОВНЫЕ ////////////////////////////

$_['entry_module_status']								= 'Режим работы модуля:';
$_['desc_module_status']								= 'В режиме отладки запись в базу не производится, но проходит все этапы загрузки товаров. При отключенном состоянии будет выходить ошибка авторизации';

$_['text_load_config']									= 'Загрузка настроек';

// Учетные системы
$_['entry_export_system']								= 'Тип учетной системы:';
$_['desc_export_system']								= 'Выбор учетной системы влияет на формирование файла заказов, обработку товаров и предложений. Подробности <a href="#">здесь</a>';
$_['text_1c_unf16']										= '1С:Предприятие УНФ 1.6';
$_['text_1c_ut11']										= '1С:Предприятие УТ 11';
$_['text_1c_ut10.3']									= '1С:Предприятие УТ 10.3';

$_['entry_username']									= 'Логин:';
$_['desc_username']										= 'Чтобы отключить проверку пароля в модуле, просто оставьте это поле пустым.';
$_['placeholder_username']								= 'Имя пользователя';

$_['entry_password']									= 'Пароль:';
$_['desc_password']										= 'Пароль указывается в настройке обмена учетной системы для связи с сайтом';
$_['placeholder_password']								= 'Введите пароль';

$_['entry_allow_ip']									= 'Разрешенные IP адреса:';
$_['desc_allow_ip']										= 'Можно указать подсеть 192.168.2<br>на каждой строке только один адрес';

$_['entry_upload_dirname']								= 'Каталог загрузки:';
$_['desc_upload_dirname']								= 'Название каталога который будет создан в ' . DIR_UPLOAD . ". в конце не надо ставить косую черту. Придумайте уникальное имя чтобы защитить Ваши данные во время обмена";

$_['entry_use_zip']										= 'Импортировать в zip формате:';
$_['desc_use_zip']										= 'Учетная система будет передавать файлы в архиве zip';

$_['entry_file_size_limit']								= 'Максимальный размер файла:';
$_['desc_file_size_limit']								= 'Например 40M - 40 Мб, только английские буквы<br>Разрешенные M - Мб, G - Гб, без буквы - байты, без пробелов';

// Лог
$_['legend_log']										= 'Журнал ошибок';

// Журнал
$_['entry_log_debug']									= 'Подробный вывод в журнал:';
$_['desc_log_debug']									= 'Вывод в журнал отладочной информации, очень полезна при поиске ошибок, более подробнее <a href="http://exchange1c.tesla-chita.ru/help#log_debug">здесь</a>.';

$_['entry_clear_log']									= 'Очистка журнала:';
$_['desc_clear_log']									= 'Журнал будет очищаться перед началом обработки файла';

$_['entry_log_memory_use_view']							= 'Cвободная память:';
$_['desc_log_memory_use_view']							= 'При включенной опции в логе будет отображаться оставшаяся свободная память для PHP, по этому значению удобно отлавливать где появляется ошибка о нехватке памяти';

// Классификаторы

// - Категории
$_['legend_categories']									= 'Категории (Группы)';

$_['entry_categories_import']							= 'Загружать категории:';
$_['desc_categories_import']							= 'Загружает структуру категорий из файла. Если отключено, то все настройки категорий не будут работать.';

$_['entry_category_new_create']							= 'Добавлять новые категории:';
$_['desc_category_new_create']							= 'Если в 1С будет создана новая категория, то при загрузке она будет создана именно в той группе как указано в настройке обмена 1С';

$_['entry_category_new_status_disable']					= 'Скрыть новые категории:';
$_['desc_category_new_status_disable']					= 'Не будут видны в каталоге посетителям сайта, ';

$_['entry_category_sort_order_from_1c']					= 'Сортировка:';
$_['text_dont_use']										= 'Не использовать (у новых = 0)';
$_['text_from_1c']										= 'Порядок как в 1С';
$_['text_from_property']								= 'Из свойства категории (нужна доработка 1С)';

// Товарные категории
$_['legend_pcategories']								= 'Товарные категории';

// Товарные категории
$_['legend_properties']									= 'Свойства товаров и товарных категорий';

// Товары

$_['legend_general']									= 'Основные';

// Режим синхронизации товаров
$_['entry_product_sync_mode']							= 'Сопоставлять по реквизиту:';
$_['desc_product_sync_mode']							= 'Если ранее товар не был загружен из 1С, то модуль попытается найти его по указанному реквизиту. ВНИМАНИЕ! если при загрузке реквизит окажется пустым, во избежание ошибок в базе. загрузка будет прервана.';

$_['entry_product_description_import']					= 'Загружать описания товара:';
$_['desc_product_description_import']					= 'Если есть описание в 1С оно будет загружено в товар, если ранее было описание, то будет замещено';

$_['entry_product_category_import']						= 'Заполнять категории товара:';
$_['desc_product_category_import']						= 'Если категория раньше была загружена из 1С то она будет прописана в товар';

$_['entry_product_category_fill_parent']				= 'Заполнить родительские категории в товаре:';
$_['desc_product_category_fill_parent']					= 'Прописывает в товар все родительские категории от основной, которая указана в файле. Не будет работать при отключении обновлении категорий товара!';

$_['entry_product_manufacturer_import']					= 'Загружать производителя:';
$_['desc_product_manufacturer_import']					= 'Производитель из 1С будут загружен в товар. Если производители в 1С указаны в свойствах, то должна быть включена опция "Загружать свойства"';

$_['entry_product_images_import']						= 'Загружать картинки:';
$_['desc_product_images_import']						= 'Записывает картинки в товар как для новых так и для существующих';

$_['entry_product_taxes_import']						= 'Загружать налоги:';
$_['desc_product_taxes_import']							= 'Если налоги не настроены не включайте, иначе обмен будет прерван если не найден нужный налог';

$_['entry_product_new_status_disable']					= 'Скрыть новые товары:';
$_['desc_product_new_status_disable']					= 'Все новые товары загруженные с 1С будут отключены и недоступны покупателям';

$_['entry_check_product_double_link']					= 'Проверять дубли связей товаров:';
$_['desc_check_product_double_link']					= 'При поиске товара в базе Ид->id, то будет сделана проверка на связи id->Ид, при наличии более 1 записи, обмен будет прерван с ошибкой. Дубли возможны при неправильной работе модуля';

// Реквизиты
$_['legend_requisites']									= 'Реквизиты';
$_['entry_product_name_from_requisite']					= '(НЕ ИСПОЛЬЗУЕТСЯ) Наименование товара из реквизита:';
$_['desc_product_name_from_requisite']					= 'Если в реквизитах есть "Полное наименование" то оно будет записано в наименование';

// Атрибуты
$_['legend_attributes']									= 'Свойства товара (Атрибуты)';
$_['entry_attribute_import']							= 'Загружать свойства:';
$_['desc_attribute_import']								= 'Свойства товара из 1С будут загружены в атрибуты';

$_['entry_attribute_group_name']						= 'Группа для свойств по-умолчанию:';

$_['entry_property_groups']								= 'Группы для определенных свойств:';
$_['desc_property_groups']								= 'Записывать каждую группу на отдельной строке, по формату "НазваниеГруппы {Свойство1, Свойство2, Свойство3, .... СвойствоN}"';


// Предложения

$_['entry_offer_non_exist_error']						= 'Прервать обмен если не найден товар по Ид';
$_['desc_offer_non_exist_error']						= 'Обмен будет прерван при загрузке предложения (цен, остатков) с ошибкой если не будет найден товар, иначе предложение будет пропущено';

// Цены

$_['legend_prices']										= 'Цены';
$_['entry_price_currency']								= 'Валюта цен:';
$_['desc_price_currency']								= 'Валюта цен в 1С, если валюта будет отличаться от валюты сайта будет применена конвертация по курсу на сайте!';

// Таблица сопоставления валюты
$_['legend_currency']									= 'Валюта';
$_['text_currency_code']								= 'Название валюты из торговой системы.';
$_['desc_currency_1c']									= 'Код валюты выгружается из учетной системы, если он отличается, то необходимо сопоставить.';

// Характеристики

$_['legend_features']									= 'Характеристики';

$_['entry_feature_import_mode']							= 'Режим загрузки характеристик:';
$_['desc_feature_import_mode']							= 'Стандартный вариант как в 1С и по свойствам объектов, если они выгружаются';
$_['text_feature_import_standart']						= 'Стандартный';
$_['text_feature_import_property']						= 'По свойствам';

// Таблица цен
// заголовки
$_['text_config_price_status']							= 'Статус';
$_['text_config_price_count']							= 'Кол-во цен';
$_['text_price_config_id']								= 'ID';
$_['text_config_price_type']							= 'Название цены в 1С';
$_['text_special']										= 'Акция';
$_['text_table']										= 'Таблица';
$_['text_product']										= 'Товар';

$_['info_table_price_price_type']						= 'Инструкцию по заполнению типов цен можно будет скоро прочитать на <a href="http://exchange1c.tesla-chita.ru">сайте модуля</a>';

// Остатки

$_['legend_rests']										= 'Остатки';

$_['entry_product_stock_status_off']					= 'Статус при отстутствии на складе:';
$_['desc_product_stock_status_off']						= 'Если общий остаток равен или меньше 0.';

$_['entry_product_stock_status_on']						= 'Статус при наличии на складе:';
$_['desc_product_stock_status_on']						= 'Если общий остаток больше 0';

// Налоги

$_['legend_tax']										= 'Связь налогов УС с налогами сайта';
$_['text_tax_name_1c']									= 'Налог в УС';
$_['text_tax']											= 'Налоговая ставка на сайте';

//////////////////////////// ЗАКАЗЫ ////////////////////////////

$_['legend_order_export']								= 'Выгрузка заказов в торговую систему';

// Дата выгрузки заказов
$_['entry_begin_orders_export'] 						= 'Начало периода выгрузки заказов:';
$_['desc_begin_orders_export'] 							= 'С указанной даты будут выгружены заказы в 1С которые еще не выгружались';

// Выгружать со статусом
$_['entry_export_order_status'] 						= 'Статусы заказа для экспорта.';
$_['desc_export_order_status'] 							= 'Заказы найденные с указанными статусами будут выгружены в учетную систему.';

// Выгружать только оплаченные
$_['entry_orders_export_only_pay'] 						= 'Выгружать только оплаченные.';
$_['desc_orders_export_only_pay'] 						= 'Неоплаченные или частично оплаченные заказы не будут выгружены';

// Выгружать с разрешенной доставкой
$_['entry_orders_export_only_shipping'] 				= 'Выгружать только с разрешенной доставкой.';
$_['desc_orders_export_only_shipping'] 					= 'Будут выгружены заказы у которых в товарах установлен флаг "Необходима доставка".';

// Менять статусы у заказов по информации из 1С
$_['entry_orders_change_status_from_1c'] 				= 'Менять статусы заказов из 1С.';
$_['desc_orders_change_status_from_1c'] 				= 'Если настроена синхронизация статусов в 1С то после обмена у заказов будет изменен статус который указан в 1С.';

// выгруженные
$_['entry_order_status_exported']						= 'Установить статус у выгруженных:';
$_['desc_order_status_exported'] 						= 'После успешной выгрузки заказа, статус у него будет изменен. Если выбрать не менять, то при следующем обмене заказы снова будут выгружены в учетную систему';

// Резервирование
$_['entry_order_reserve_product']						= 'Резервировать товары:';
$_['desc_order_reserve_product'] 						= 'Товары в заказе будут зарезервированы в 1С';

//////////////////////////// РУЧНАЯ ОБРАБОТКА ////////////////////////////

$_['help_upload']										= 'Загружать можно *.XML или *.ZIP файлы';
$_['entry_upload']										= 'Выберите файл:';
$_['desc_upload_file']									= 'Подробную информацию о загрузке файла смотрите <a target="_blank" href="http://exchange1c.tesla-chita.ru/">тут (ссылка будет позже)</a>';

$_['button_download_orders']							= 'Кнопка скачать заказы';
$_['help_download_orders']								= 'Скачивается файл orders.xml';
$_['entry_download_orders']								= 'Скачать заказы (orders.xml)';
$_['desc_download_orders']								= 'Подробную информацию о ручной выгрузке заказов в УС смотрите <a target="_blank" href="http://exchange1c.tesla-chita.ru/">тут (ссылка будет позже)</a>';

//////////////////////////// ИНФОРМАЦИЯ ////////////////////////////

$_['entry_first_load_config']							= 'Первая загрузка настроек:';
$_['desc_first_load_config']							= 'Дата когда первый раз был обмен в режиме загрузки настроек';

$_['entry_first_import_data']							= 'Первая загрузка данных:';
$_['desc_first_import_data']							= 'Дата когда первый раз был обмен в режиме загрузки данных';

$_['entry_max_execution_time']							= 'Время работы PHP, сек:';
$_['desc_max_execution_time']							= 'Максимальное время выполнения PHP кода в секундах. Если модуль не успеет за это время уложится, то обмен прервется.';

$_['entry_memory_limit']								= 'Память для PHP:';
$_['desc_memory_limit']									= 'Максимальное количество памяти для выполнения PHP. Если модулю не хватит памяти, то обмен прервется.';

//////////////////////////// СЕРВИСНЫЕ ФУНКЦИИ ////////////////////////////

$_['entry_setting_default']								= 'Настройки по умолчанию:';
$_['text_button_setting_default']						= 'Сбросить настройки';
$_['desc_setting_default']								= 'После сброса необходимо обновить страничку';

$_['entry_cleaning_db']									= 'Очистка базы данных:';
$_['text_button_cleaning_db']							= 'Очистить таблицы';
$_['desc_cleaning_db']									= 'Пересоздает заново таблицы модуля, удаляет товары, картинки, категории. Не сбрасывает настройки.';

$_['entry_delete_import_data']							= 'Удаление загруженных данных:';
$_['text_button_delete_import_data']					= 'Удалить';
$_['desc_delete_import_data']							= 'Удаляет только загруженные данные, товары, категории, картинки что были загружены через модуль. Товары созданные на сайте вручную не удаляет.';

$_['entry_remove_unised_manufacturers']					= 'Удалить неиспользуемых производителей';
$_['text_button_remove_unised_manufacturers']			= 'Удалить';
$_['desc_remove_unised_manufacturers']					= 'Если производитель не указан ни в одном товаре, он будет удален, также будут удалены все его связи с УС.';

$_['entry_remove_unised_images']						= 'Удалить неиспользуемые картинки';
$_['text_button_remove_unised_images']					= 'Удалить';
$_['desc_remove_unised_images']							= 'Проверяется каталог /image/import_files, если картинка не используется в товаре или опции, то она будет удалена. Подробнее читать <a href="#">здесь</a>.';

$_['entry_update_catalog']								= 'Обновить каталог:';
$_['text_button_update_catalog']						= 'Обновить';
$_['desc_update_catalog']								= 'Обновляет цены, остатки, опции из загруженных данных из 1С, подроности читать <a href="#">здесь</a>';

$_['entry_remove_module']								= 'Удалить данные о модуле';
$_['text_button_remove_module']							= 'Удалить';
$_['desc_remove_module']								= 'Удаляет таблицы модуля, файлы, модификаторы и настройки, не удаляет только загруженные данные';

$_['entry_export_module']								= 'Экспорт модуля';
$_['text_button_export_module']							= 'Экпортировать';
$_['desc_export_module']								= 'Упаковывает файлы модуля в zip архив ocmod для повторной установки через меню расширений';

//////////////////////////// СПРАВКА ////////////////////////////

?>